app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "answers" ("answerer", "body", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["answerer", "Susan"], ["body", "You're fucking stupid"], ["question_id", 2], ["created_at", "2015-03-17 23:06:18.040781"], ["updated_at", "2015-03-17 23:06:18.040781"]]
---
  def create
    @question = Question.find(params[:question_id])
    @answer = @question.answers.create(answer_params)