app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)

    if @question.save
---
INSERT INTO "questions" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "How do I internet?"], ["text", "CATS"], ["created_at", "2015-03-17 18:33:44.290626"], ["updated_at", "2015-03-17 18:33:44.290626"]]

  def update
    @question = Question.find(params[:id])

    if @question.update(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "questions" SET "title" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["title", "Where's the beef? HOMOS"], ["updated_at", "2015-03-18 17:59:02.730550"], ["id", 1]]

  def upvote
    @question = Question.find(params[:id])
    @question.increment!(:upvote)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "questions" SET "upvote" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["upvote", 1], ["updated_at", "2015-03-18 16:09:00.631940"], ["id", 1]]

  def downvote
    @question = Question.find(params[:id])
    @question.decrement!(:downvote)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "questions" SET "downvote" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["downvote", -1], ["updated_at", "2015-03-18 17:07:26.147564"], ["id", 1]]

  def destroy
    @question = Question.find(params[:id])
    @question.destroy
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 4]]